In [22]:
import numpy as np
import pandas as pd

In [2]:
#nan is used when we have a missing value in the data set.
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
#isnull() and isna() are synonyms
pd.isna(None)

True

In [5]:
s = pd.Series([1,2,3,np.nan, np.nan, 4])

In [6]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [7]:
#this gives the count of numbers that are not null
pd.notnull(s).sum()

4

In [8]:
#this gives the count of numbers which are null
#note- this takes into account the grouping based on true or false value
pd.isnull(s).sum()

2

In [9]:
#printing the values of not null elements
s[pd.notnull(s)]  # another way of removing null values is to use dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [10]:
pd.notnull(s).count()

6

In [11]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [27]:
df = pd.DataFrame({
    
    'Column A': [1, np.nan, 30, 23],
    'Column B': [5,np.nan,43,np.nan],
    'Column C': [22,np.nan,np.nan,np.nan],
    'Column D': [56,45,21,32],
})

In [24]:
df

   Column A  Column B  Column C  Column D
0       1.0       5.0       NaN        56
1       NaN       NaN       NaN        45
2      30.0      43.0       NaN        21
3      23.0       NaN       NaN        32

In [28]:
df.dropna(how='all')

   Column A  Column B  Column C  Column D
0       1.0       5.0      22.0        56
1       NaN       NaN       NaN        45
2      30.0      43.0       NaN        21
3      23.0       NaN       NaN        32

In [29]:
df.dropna(how='any')

   Column A  Column B  Column C  Column D
0       1.0       5.0      22.0        56

In [30]:
#thresh parameter indicates a threshold value(minimum value) of non-null values for the row/column to be kept
df.dropna(thresh = 3)

   Column A  Column B  Column C  Column D
0       1.0       5.0      22.0        56
2      30.0      43.0       NaN        21

In [33]:
#Filling the null values by arbitrary number like 0
df.fillna(0)

   Column A  Column B  Column C  Column D
0       1.0       5.0      22.0        56
1       0.0       0.0       0.0        45
2      30.0      43.0       0.0        21
3      23.0       0.0       0.0        32

In [34]:
df.fillna(method='ffill')  #ffill methos lets the null value assign to it prev value , hence filling takes place in forward manner.

   Column A  Column B  Column C  Column D
0       1.0       5.0      22.0        56
1       1.0       5.0      22.0        45
2      30.0      43.0      22.0        21
3      23.0      43.0      22.0        32

In [35]:
df.fillna(method='bfill') #this fills the null values in the backward direction.

   Column A  Column B  Column C  Column D
0       1.0       5.0      22.0        56
1      30.0      43.0       NaN        45
2      30.0      43.0       NaN        21
3      23.0       NaN       NaN        32

In [37]:
df

   Column A  Column B  Column C  Column D
0       1.0       5.0      22.0        56
1       NaN       NaN       NaN        45
2      30.0      43.0       NaN        21
3      23.0       NaN       NaN        32

In [36]:
df.fillna(method ='ffill', axis=1) #axis = 1 mean forward filling takes place for rows- ie horizontally

   Column A  Column B  Column C  Column D
0       1.0       5.0      22.0      56.0
1       NaN       NaN       NaN      45.0
2      30.0      43.0      43.0      21.0
3      23.0      23.0      23.0      32.0

In [38]:
df.fillna(method ='ffill', axis=0) #axis = 0 mean forward filling takes place for columns- ie vertically

   Column A  Column B  Column C  Column D
0       1.0       5.0      22.0        56
1       1.0       5.0      22.0        45
2      30.0      43.0      22.0        21
3      23.0      43.0      22.0        32

In [55]:
#Cleaning not-null values
df2 =pd.DataFrame({
    'Sex':['M','F','T','F','?'],
    'Age':[20,18,250,39,40],
})

In [40]:
df2

  Sex  Age
0   M   20
1   F   18
2   T  250
3   F   39
4   ?   40

In [41]:
#unique() -gives the unique values present in a data frame

df2['Sex'].unique()  #OR

array(['M', 'F', 'T', '?'], dtype=object)

In [42]:
#value_counts()- gives the count of each value
df2['Sex'].value_counts()

F    2
M    1
?    1
T    1
Name: Sex, dtype: int64

In [45]:
df2.replace('F','Female').replace('M','Male').replace('T','Transgender')

           Sex  Age
0         Male   20
1       Female   18
2  Transgender  250
3       Female   39
4            ?   40

In [56]:
#another way of using replace for multiple values in the dictionary format-
df2['Sex'].replace({'Female':'F','Male':'M','Transgender':'T'})

0    M
1    F
2    T
3    F
4    ?
Name: Sex, dtype: object

In [48]:
#if there are many columns to replace, use the below way-
df2.replace({
    'Sex':{
        'M':'Male',
        'F':'Female',
        'T':'Transgender',
        '?':'Unknown'
    },
    'Age':{
        250:25
    }
           })

           Sex  Age
0         Male   20
1       Female   18
2  Transgender   25
3       Female   39
4      Unknown   40

# now that we know that there exists a value that is > 100, we can rectify that
df2[df2['Age']>100]

In [58]:
#loc[]-  method is a method that takes only index labels and returns row or dataframe if the index label exists in the caller data frame
df2.loc[df2['Age']>100,'Age'] = df2.loc[df2['Age']>100,'Age']/10

In [59]:
df2.loc[df2['Age']>100,'Age']

Series([], Name: Age, dtype: float64)

In [60]:
df2

  Sex   Age
0   M  20.0
1   F  18.0
2   T  25.0
3   F  39.0
4   ?  40.0

In [63]:
#Removing Duplicates

ambassadors=pd.Series(
[
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
],
index=
[
    'Geraud Araud',
    'Kim Darroch',
    'Peter westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth'
])

In [64]:
ambassadors

Geraud Araud                  France
Kim Darroch           United Kingdom
Peter westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [65]:
#duplicated()- this is the function to identify the duplicates
#drop_duplicates()- this is the function to drop the duplicates

ambassadors.duplicated()  #- this assigns true value for duplicate values

Geraud Araud          False
Kim Darroch           False
Peter westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [69]:
#using keep=last, we can consider the last occurence as unique and rest of the occurence as duplicate.
ambassadors.duplicated(keep='last')

Geraud Araud          False
Kim Darroch            True
Peter westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [67]:
ambassadors.duplicated(keep=False) #keep = False lets all the occurrences of duplicate values to be set to true irrespective of 1st value being unique.

Geraud Araud          False
Kim Darroch            True
Peter westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [71]:
ambassadors

Geraud Araud                  France
Kim Darroch           United Kingdom
Peter westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [70]:
#this will eliminate all the duplicates values after 1st occurence
ambassadors.drop_duplicates()

Geraud Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [72]:
#this will remove all the duplicate values , irrespective of any position of the duplicate
ambassadors.drop_duplicates(keep=False)

Geraud Araud          France
Armando Varricchio     Italy
dtype: object

In [73]:
#this will include the last occurrence of the duplicates.
ambassadors.drop_duplicates(keep='last')

Geraud Araud                  France
Peter westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [74]:
#Splitting Columns
df= pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_2',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I T_2'
    ]})

In [75]:
df

              Data
0     1987_M_US _1
1     1990?_M_UK_2
2      1992_F_US_2
3  1970?_M_   IT_1
4     1985_F_I T_2

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    5 non-null      object
dtypes: object(1)
memory usage: 168.0+ bytes

In [77]:
df['Data'].str.split('_') #this splits the string based on string shown- '_'

0       [1987, M, US , 1]
1       [1990?, M, UK, 2]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4       [1985, F, I T, 2]
Name: Data, dtype: object

In [80]:
df= df['Data'].str.split('_', expand = True) #expand creates a dataframe of the usecase

In [81]:
df.columns = ['Year','Sex','Country','Children_Count']

In [82]:
df

    Year Sex Country Children_Count
0   1987   M     US               1
1  1990?   M      UK              2
2   1992   F      US              2
3  1970?   M      IT              1
4   1985   F     I T              2

In [86]:
#this is to check if the year column contains '?' symbol
df['Year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [89]:
df['Country'].str.contains('U') #checks if country col values contain 'U' in it

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

In [90]:
#strip Remove spaces at the beginning and at the end of the string:
df['Country'].str.strip()

0     US
1     UK
2     US
3     IT
4    I T
Name: Country, dtype: object

In [91]:
df['Country'].str.replace(' ','')

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object